class Patient {

    String name;

    // write your method here
    public void say() {
        System.out.printf("Hello, my name is %s, I need a doctor.", name);
    }
}
/*
Вот класс с именем Patient. В нём есть одно строковое поле с именем.

Вы хотите создать метод, который позволит вашему пациенту вызвать врача.
Добавьте метод, который выводит сообщение, содержащее имя пациента (вместо "...") и его запрос на вызов врача:

Здравствуйте, меня зовут ..., мне нужен врач.

Этот метод не принимает никаких параметров и ничего не возвращает.
 */